[
  {
    "path": "posts/2021-03-21-armed-conflict-in-southeast-asia/",
    "title": "Armed Conflict in SouthEast Asia",
    "description": "Visualization about the conflicts in SouthEast Asia",
    "author": [
      {
        "name": "WU YUFENG",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-03-21",
    "categories": [],
    "contents": "\r\n1 Overview \r\nSoutheast Asia is often prone to conflict due to its relatively backward economic status and large number of small countries. This post mainly analyzes the frequency, region and type of conflict in Southeast Asia in recent years through the distribution map of conflict occurrence.\r\n2 Critiques and Suggestion \r\n\r\n\r\n\r\n2.1 Clarity \r\nIn this segment, we will explore ways we can improve the visual clarity of this visualisation.\r\n2.1.1 No introduction about the visualization\r\nThere is no lead-in paragraph in this visualization, which means nothing can help reader to understand what exactly the chart express, 2.1.2 Dense and small dots\r\nDue to the points on the map overlap each other (highlighted below), the map does not clearly show the frequency of events in each region.\r\n2.1.3 Synchronised y-axis lable\r\nThe scale of the y-axis of these charts are not synchronised under different event. Besides, the y-axis tick marks are of varying scale for Armed Conflict Event by Type. Should the user miss to notice this, the user will be comparing the event counts and trends incorrectly.\r\n2.1.4 No country name\r\nThere is no country name on the map which would make reader confused with the conflict location.\r\n2.1.5 Toolip information not enough\r\nThe toolip information could include more useful information such as ‘notes’, ‘Event date’.\r\n1.2 Asethetics \r\n2.2.1 Single Filter\r\nReader could not get enough information or comparison between countries or different years due to the limit of the single filter.\r\n2.2.2 Single color in different event types\r\nThe line chart should be colored accordingly by Event Type for consistency. There are different colors of Event Type in map, it should be same in line chart.\r\n2.2.3 No indication of data source\r\nThere is no indication of data source in the map and chart.\r\n3 Proposed Design \r\n\r\n\r\n\r\n Improvements \r\n3.1 Add some useful information into toolip like ‘Notes’, ’ Event date’, ‘Fatalities’.\r\n3.2 Make three maps from conflict status, fatalities status and geolocoation aspect, which will give reader basic knowledge of conlicts condition in SouthEast Asia.\r\n3.3 For better visualization, map and chart will use same color for different event types.\r\n3.4 Three filters ‘Year’, ‘Event Type’, ‘Country’ give reader free space to choose what they want to analysis.\r\n4 Step-by-step Description 4.1 Data Preparation \r\nDrag the data file ‘Southeast-Asia_2010-2020_Oct31’ onto Tableau.\r\n\r\n\r\n\r\nChange the Year to Date.\r\n\r\n\r\n\r\n4.2 Analysis Preparation \r\nCreate Parameter ‘Analysis Angle’.\r\n\r\n\r\n\r\nCreate Calculation field ‘Chart Type Filter’.\r\n\r\n\r\n\r\nCreate Calculation field ‘Confilct’ to count the number of conflicts.\r\n\r\n\r\n\r\n4.3 Make Analysis of Geolocation \r\nDrag the existed measure value “Longitude” on columns and “Latitude” on rows instead of the longitude and latitude that tableau automatically generated for us.\r\n\r\n\r\n\r\ndrag other measure names into the Marks.\r\n\r\nDrag ‘Country’, ‘Year’, ‘Event Type’, ‘Chart Type Filter’ into filter.\r\n\r\n\r\n\r\nFor parameter ‘Analysis Angle’ click on show parameter and\r\nshow the fiter ‘Country’, ‘Year’, ‘Event Type’. Here is the final map.\r\n\r\n\r\n\r\n4.4 Make Analysis of Conflict and Fatalities Status \r\nDrag the existed measure value “Longitude” on columns and “Latitude” on\r\nrows as well and drag measure names into marks.\r\n\r\n\r\n\r\nDrag the filter values into Flilter and the final map is below.\r\n\r\n\r\n\r\nDuplicate ‘Conflict Status’ and change the Sum(conflicts) to Fatalities.\r\n\r\n\r\n\r\n\r\n\r\n\r\n4.5 Make Analysis of Line Charts \r\nDrag the ‘Year’ to columns and ‘Confilct’ to rows.\r\n\r\n\r\n\r\nDrag the chart type filter into Filter and choose ‘Conflict Status’.\r\n\r\n\r\n\r\nDrag ‘Event Type’ onto colors and the final chart is below.\r\n\r\n\r\n\r\nDuplicate the ‘Conflict Line’ and replace the ‘Conflicts’ with ‘Fatalities’.\r\n\r\nChoose ‘Fatalities’ for ‘Chart Type Filter’.\r\n\r\n\r\n\r\n4.6 Dashboard Design \r\nDrag ‘Vertical’ to the dashboard and then drag ‘Geolocation’ sheet into it, choose automatic for dashboard size.\r\n\r\n\r\n\r\nHide the ‘Geolocation’ title.\r\n\r\n\r\n\r\nDrag ‘Conflict Status’ into dashboard and choose ‘Conflict Status’ in parameter ‘Analysis Angle’.\r\n\r\n\r\n\r\nHide ‘Conflict Status’ title and then drag ‘Conflict Status’ into dashboard and choose ‘Fatalities Status’ in parameter ‘Analysis Angle’.\r\n\r\n\r\n\r\nRomove repeated filter and move ‘Country’, ‘Year’, ‘Event Type’ to the top of dashboard.\r\n\r\n\r\n\r\nChange the three filters’ value to Single Value(list).\r\n\r\n\r\n\r\nDrag the ‘Conflict Line’ and ‘Fatalities’ beside the map and add the name on the top-middle of the dashboard.\r\n\r\n\r\n\r\n5 Observations \r\n5.1 Conflicts in SouthEast Asia From the two graph below we can see that in South-east Asia, conflicts happened the most in Philippines, Myanmar. The rest region has relatively less conflicts and there are no conflicts happened in Singapore between 2010 and 2020.\r\n\r\n\r\n\r\n\r\n\r\n\r\nBesides, in Geolocation map Philippines and Myanmar have more circles as well, which means there are lots of event occurred in this two places.\r\n\r\n\r\n\r\n5.2 Conflicts in Myanmar\r\nAs we can see from the Conflict Status map, Myanmar has the Heaviest color in SouthEast Asia between 2015-2020. Besides, battles account for the largest proportion of them from the bar below.\r\n\r\n\r\n\r\n5.3 Conflicts in Philippines The Philippines is another area that has a lot of conflicts every year in Southeast Asia. The difference from Myanmar is that ‘Violence against civilians’ account for the largest proportion of the conflicts.\r\n\r\n\r\n\r\nHowever, from the bar below, we can see that ‘Violence against civilians’ in Philippines has a descending trend these years.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-21-armed-conflict-in-southeast-asia/Pictures/01.jpg",
    "last_modified": "2021-03-22T19:18:46+08:00",
    "input_file": "armed-conflict-in-southeast-asia.utf8.md"
  },
  {
    "path": "posts/2021-02-19-datavizmakeover2/",
    "title": "Datavizmakeover2",
    "description": "Data Visualization of the survey about people's concepts on COVID-19",
    "author": [
      {
        "name": "WU YUFENG",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n1 Critiques and Suggestion \r\n Critiques and Suggestions \r\n\r\n Clarity \r\n1) it is difficult to see the proportion of people holding a supportive attitude in each country. In this figure, the proportion of people holding a supportive attitude of more than 3 is higher than that in other countries. The reason is that the red part (indicating 3) of each bar is in a different location and is difficult to compare due to the different starting points. To fix this, I’ll use a Gantt Chart to fix it later, since it allows all neutral parts to be in the same position.\r\n2) Figure 1 appears to be sorted alphabetically, but the second graph on the right is sorted by a decreasing proportion of “strongly agree” responses. This may confuse users, especially when the second chart may be intended to give a clearer picture of vaccination status in individual countries. 3) The survey contains many questions, and the current visualization only displays answers related to one question. This diminishes the usefulness of this investigation.\r\n4) The results displayed by these two visualizations represent the percentage of total records for each country. However, the audience cannot tell how much the total result is and may not know how representative the result is in the country. For example, compared to a chart with 1000 results, a chart with only 10 results does not represent the population well.\r\n Asethetics \r\n1) The format of countries name is not standard. The first character should be in captilized.\r\n2) The color meaning of different agree degree does not match.\r\n3) The actual content of the survey question is not displayed, but kept as “Vac 1”. It is hard for reader to understand what “Vac 1” actually mean. 4) Spelling mistake in chart 1 title is obviously, which make the visualization seems not professional.\r\n Proposed Design  The proposed design comprises two visualisations and a panel with controls.\r\nThe visualisation in the top right uses divergent stacked bars to present the survey data for each country.The controls will allow the viewer to select Survey Questions “Questions”. This allows the user to select various questions related to vaccines for analysis.\r\nThe visualisation in the top left shows the proportion of survey respondents who agree with a survey question by the various countries. The controls will allow the viewer to select:\r\n1. Questions\r\n2. Z_Value - This allows the user to select what elements to display on the charts, whether to include the actual percentage, the 95% error bars and/or the 99% error bars.\r\n3. Breakdown By - This allows the user to to further breakdown the results by Age, Gender, Household Size, or Household Children.\r\nThe proposed design improves on the original design on the following areas:\r\nMake the survey question clearer for reader to understand\r\nConfidence level chart will help reader to know the specific condition under different groups, like “Age”, “Household_size”.\r\nGive the control panel for reader to choose anything they are interested in to see the analysis.\r\n1 Data Preparation \r\n1.  Data Import \r\nAfter downloading all the files we neeed and put them in the same folder, drag one into Tableau. And we can see all the csv below the files list. Then click on New Union move all the csv into new union. knion  2.  Data cleaning \r\nRename “Table Name” to “Country”, then hide all the columns except “Country”, “Age”, “Gender”, “Household_size”, “vac1”, “vac2_1”, “vac2_2”, “vac2_3”, “vac2_6” and “vac3”. Then privot the six questions and rename them.\r\n Gantt Bar \r\nThen, move to sheet 1 and aliases “Country” and “Questions” \r\n Creating Calculation fields \r\n1. Create new Calculated field to convert them from string into an integer format.  2. Create a record list using a calculated field and setting the value as 1  3. Create a Total Count Calculated Field.  4. Create a Percentage Calculated Field to define the size of the bar chart.  5. Create a Count Negative Calculated Field to define the values for the likert scale diagram.  6. Create a Total Count Negative Calculated Field to consolidate all negative values.  7. Create a Gantt Start Calculated Field to define the start of the Gantt Chart.  8. Create a Gantt Percentage Calculated Field to define the size and scale of the likert scale diagram.  Drawing Gantt Bar \r\n1. Drag “Country” to Rows, “Gantt Percent” to Columns, “Comment” to Colour and Details, “Percentage” to Size.  2. Choose Compute Using as “Comment” 3. Drag the “Comment” and “Questions” to filters, click show filters.  Rignt-Hand Chart \r\nCreating Calculation Fields and Parameters 1. Creating Groups of “age” and “Household_size”  2. Creating “Z_Value” and “Breakdownby” Parameter  3. Create “%Agree” calculation fields, which shows the percentage of those who select strongly agree or 2.  4. create a field for “Standard Error”. Standard error is computed using the formula as mentioned on class.  5. Creat calculation filed named with “Breakdown field”.  6. Create “Margin Error” and using parameter “Z_Value”  7. Create “Upper Value” and “Lower Value”.  8. Drag “%Agree” to columns, “Upper Value” and “Lower Value” to X axis, then dual axis and synchronise axis. Drag “Breakdownfiled” to rows. 9. Change the mark to path under measure values and color under “AGG” 10. Show the parameter “Breakdownby” and “Z_Value”, and change the question to Single Value list. Dashboard Now, drag the two chart to dashboard and make some improments to make it better. Observations \r\n1. As we can see the chart below, We can roughly infer that people in South Korea are more worried about getting Covid-19, while people in Australia shows least concern with this.  When we choose question “I believe government health authorities in my country will provide me with an effective COVID19 vaccine”, we can see people in South Korea shows little trust in their government from the chart below. So the support from government can help reduce people’s worry.  2. People in different age groups shows different worry level about getting COVID-19. Obviously there is a rising trend with the age older from the chart below. 3. When select the “Household_size” as breakdownby, we can see people’s worry about getting COVID-19 goes down except those who has only one house. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-22T19:17:29+08:00",
    "input_file": "datavizmakeover2.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-05",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-05T15:23:12+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-05-datavizmakeover/",
    "title": "Dataviz_Makeover",
    "description": "Data Visualization about Labor Force in Singapore.",
    "author": [
      {
        "name": "Wu Yufeng",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-05",
    "categories": [],
    "contents": "\r\n1 Critiques and Suggestion for the current visualization\r\nThe current visualization can be found at Chart 6 Resident labour force by age in MOM’s Report: Labour Force in Singapore 2019 to indetify possible areas of improvement. Clarity Issues\r\n1) The current visualization analysis only uses the data of 2009 and 2019, and lacks the data of 2010-2018, so it is impossible to know the changes of each age group in these intermediate years, so it is impossible to analyze the continuous changes of the age distribution of the labor force over the years in a more specific and detailed way.\r\nSuggestions: Add each year data into the visualization and see the changing trend.\r\n2) The original percentage of each age group in the excel report is the percentage of the population in that age group in the labor force, so it cannot be calculated as the percentage of whole ammount of labor force.\r\nSuggestions: use the original data.\r\n3) The current visualization donot have Y axis. It is not clear for readers to know what exactly the chart want to show. Actually it can highlight the number of each point, which would be easy to let the reader know the difference between 2009 and 2019.\r\nSuggestions: add Y axis.\r\n4) The median line could not be the specific age. It cannot calculate a median age from discrete variables.\r\nSuggestions: remove the median line.\r\nAesthetics Issues\r\n1) Title is not accurately express the chart. It seems like this chart only tell us the number of labor force of each age group.\r\nSuggestions: Change the title.\r\n2) Line chart does not fit this visualization, due to the X axis is age group in different intervals.\r\nSuggestions: Use Bar chart.\r\n3) Font size and title location. Title should be right in the middle above the chart and all the font should be in same size.\r\nSuggestions: Move the title middle above the chart and change all the font into same size.\r\n2 Proposed design\r\n\r\nThe first butterfly chart is going to show the difference of labor force by genders in a selected year from 2009 to 2019. The second line chart is the trend of labor force by different age groups from 2009 to 2019.\r\n3 Proposed Data Visualization\r\nPlease view the interactive visualization on Tableau Public here\r\n4 Step by Step Guide\r\nAs we can see, there are three data sheets which are Males, Females and Total.\r\n\r\nIn order to make the data more conducive to the subsequent visualization operations, we processed the original data in Excel, and the processed data is shown in the following figure. \r\nThen Import the data into Tableau Butterfly Chart–% Labor Force of Different Age Group by Gender in 1) Create calculated fields \r\n2) Build the chart \r\nThen make X axis reversed and hide the Y axis. After that, drag the Gender1 and drop into color under Males and Females.\r\nAnd now the chart would be like this Then change the 0 axis type into text and drag the Age1 into Text.\r\nNow, drag the Year1 into filter, select all and show the filter. Make the filter single value.\r\nFor the title, remember to insert Year1.\r\nFinally, show mark lables for both gender and the chart is finished. \r\nLine chart-Labor Force Trend by Age Group from 2009 to 2019 \r\n\r\n\r\nFinally, the chart is finished and shows like this.5 Insights\r\n1) Percentage of labor force in females decreased from 30 while from 44 for males.\r\n2) Percentage of labor force in males are almost same in the 30 years from 25 to 55.\r\n3) The increased percentage of labor force above 55 is obviously higher than other age group.\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T16:17:48+08:00",
    "input_file": "datavizmakeover.utf8.md"
  }
]
